#include"iostream"
#include"Windows.h"

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	using namespace std;
	cout << "Привіт,гарний і чудовий ранок!\n";

	//Для роботи з циклом for є спеціальний синтаксис його запису
	//оператор інкременту
	// int i=0;
	//i++; аналогічно як в пайтон і=і+1
	// і=і-1 зменшення на 1 декременто операція
	//і-- аналогічно , що і=і-1
	//цикл повторює одну і ту саму операцію,кількість повторів визначає якась змінна
	//for(ініціалізація змінних циклу;умова продовження циклу;лічильник циклу)
	//{початок роботи циклу
	//...тіло циклу
	//} кінець тіла циклу
	//ініціалізація циклу виконується на початку один раз
	//умова продовження циклу-перевіряється на кожній ітерації циклу
	//лічильник роботи циклу-змінює крок роботи циклу-виконується кожен раз після тіла циклу

	//Робимо цикл , який  виводить числа від 1 до 10
	//n-кількість  ітерації циклу
	//int n = 10;
	for (int i = 1; i<=10; i++)
	{
		cout <<i<< '\t'; // "" - якщо більіше двох символів
	}
	cout << "\n";

	//Зроблю програму,у якій користувач вводить діапазон
	int begin, end;
	cout << "Вкажіть  початок діапазону\n";
	cin >> begin;
	cout << "Вкажіть кінець діапазону\n";
	cin >> end;
	for (int i = begin; i <= end; i++)
	{
		if (i%2==0)
			cout << i <<'\t';
	}
	cout << "\nДякуємо!";

	return 0;

}