#include"iostream"
#include"Windows.h"

int main()
{
	using namespace std;
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);

	cout << "---Робота з циклом while---\n";
	//Цикл while працює так само яку пайтон
	// while(умова циклу)
	//{--початок тіла циклу
	// ...що робить цикл
	//} кінець тіла циклу
	//ініціалізація змінних циклу:
	int i = 10; //будк виводитит на екран числа від 0 до 10
	while (i != 0) //умова продовження циклу поки не досягнемо 0
	{
		cout << "i= " << i << "\n";
		i--; //Зменшуємо лічильник циклу на 1
	}
	return 0;
}