#include"iostream"
#include"Windows.h"

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	using namespace std;

	cout << "---Працюємо із циклом do while---\n";
	//do while-це цикл з передумовою
	//спочатку іде тіло циклу , а потім перевіряється умова продовження циклу
	//Можна зробити меню з вибором операцій
	int action = 0; //0-вихід з програми
	do
	{
		cout << "0. Вихід\n";
		cout << "1. Показати користувачів\n";
		cout << "2. Додати нововго користувача\n";
		cout << "_>_";
		cin >> action;
		if (action == 1)
		{
			cout << "Користувач 1 ,2,3...\n";
		}
		else if (action == 2)
		{
			cout << "Додаємо нового користувача\n";
		}
		else if (action != 0) //Якщо дія не ноль , а 4, 52,8 і т.д 
		{
			cout << "--Ви вказали невірну операцію--\n";
		}
	} 
	while (action != 0);//якщо буде 0 то програма перестає працювати і повторюваати цикл
	return 0;
}
